Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/SUI_СообщенияМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_СообщенияМобильныхУстройств</name>
  <resources>
    <name>Сообщение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>МеткаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_СообщенияМобильныхУстройств/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ, Замещение)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		
		Если Отбор.ID.Значение = "0000000000000000000000000000000000000000" Тогда
			ВызватьИсключение НСтр("ru = 'Не сформирован идентификатор сообщения.'");
		ИначеЕсли Не ИдентификаторСоответствует(Отбор.ID.Значение) Тогда
			ВызватьИсключение НСтр("ru = 'Не правильный идентификатор сообщения.'");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отбор.Отправитель.Значение) И ЗначениеЗаполнено(Отбор.Отправитель.Значение) И 
			Отбор.Отправитель.Значение = Отбор.Получатель.Значение Тогда
			ВызватьИсключение НСтр("ru = 'Отправитель не может быть равен получателю.'");
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Отбор.Получатель.Значение) И Отбор.Получатель.Значение <> ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		
		Если Количество() > 0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Отбор.Получатель.Значение, ЭтотОбъект);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторСоответствует(ID)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ID
		|ГДЕ
		|	&ID ПОДОБНО &ШаблонID";
	
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.УстановитьПараметр("ШаблонID", ШаблонИдентификатора());

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ШаблонИдентификатора() Экспорт
	
	ЧастиШаблона = Новый Массив();
	
	Для Индекс = 1 По 40 Цикл
		ЧастиШаблона.Добавить("[a-f0-9]");
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиШаблона);
	
КонецФункции

#КонецОбласти

#КонецЕсли
